app/Services/CartService.php

    private function getCart()
    {
        $session = session();

        $user = $session->get('user');
        $userId = 0;

        if ($user && isset($user['isLoggedIn']) && $user['isLoggedIn'] === true) {
            $userId = $user['userId']; // use 'id' not userId
        }

        $sessionId = $this->getCartSessionId();

        if ($userId) {
            $this->mergeCartAfterLogin();
            $cart = $this->cartModel->where('user_id', $userId)->first();
            if ($cart) {
                return $cart;
            }
        }

        return $this->cartModel->where('session_id', $sessionId)->first();
---
SELECT *
FROM `carts`
WHERE `user_id` = '2'
 LIMIT 1
SELECT *
FROM `carts`
WHERE `session_id` = 'hlinr38l95fcvsiknddnai9l1h4altl6'
 LIMIT 1

    public function mergeCartAfterLogin()
    {
        $session = session();
        $user = $session->get('user');

        if (!$user || !$user['isLoggedIn']) return;

        $userId = $user['userId'];
        $sessionId = $this->getCartSessionId();

        if (!$sessionId) return;

        // Session cart
        $sessionCart = $this->cartModel->where('session_id', $sessionId)->where('user_id', 0)->first();
---
SELECT *
FROM `carts`
WHERE `session_id` = 'hlinr38l95fcvsiknddnai9l1h4altl6'
AND `user_id` = 0
 LIMIT 1

     private function createCart()
    {
        $session = session();
        $user = $session->get('user');
        $userId = 0;

        if ($user && isset($user['isLoggedIn']) && $user['isLoggedIn'] === true) {
            $userId = $user['userId']; // use 'id' not userId
        }
        return $this->cartModel->insert([
            'user_id'    => $userId,
            'session_id' => $this->getCartSessionId(),
            'created_at' => date('Y-m-d H:i:s')
        ]);
---
INSERT INTO `carts` (`user_id`, `session_id`, `created_at`) VALUES ('2', 'hlinr38l95fcvsiknddnai9l1h4altl6', '2026-04-04 10:52:30')

   public function add($data)
    {
        $productId = $data['product_id'] ?? null;
        $qty       = max(1, (int)($data['qty'] ?? 1));

        $product = $this->productManageModel->find($productId);
        $stockItem = $this->productModel->find($product['product_id']);
        if (!$product || $stockItem['current_stock'] < $qty) {
            return ['status' => false, 'message' => 'Out of stock'];
        }

        $productPrice =  calculatePrice(
                    $product['price'],
                    $product['compare_price'],
                    $product['price_offer_type']
            );

            $offerPrice  = $productPrice['offer_price'];
            $discount    = $productPrice['discount'];
            $actualPrice = $productPrice['actual_price'];

        $cart = $this->getCart();
        $cartId = $cart['id'] ?? $this->createCart();

        $item = $this->itemModel
            ->where('cart_id', $cartId)
            ->where('product_id', $productId)
            ->first();
---
SELECT *
FROM `products`
WHERE `products`.`id` = '5'
SELECT *
FROM `cart_items`
WHERE `cart_id` = 99
AND `product_id` = '5'
 LIMIT 1

                'updated_at' => date('Y-m-d H:i:s')
            ]);
        } else {
            $this->itemModel->insert([
                'cart_id' => $cartId,
                'product_id' => $productId,
                'price' => $offerPrice,
                'quantity' => $qty,
                'subtotal' => $qty * $offerPrice
            ]);
---
INSERT INTO `cart_items` (`cart_id`, `product_id`, `price`, `quantity`, `subtotal`) VALUES (99, '5', 401, 1, 401)

        return [
            'status' => true,
            'message' =>'Added to cart',
            'cartCount' => $this->itemModel
                ->where('cart_id', $cartId)
                ->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `cart_items`
WHERE `cart_id` = 99

    public function getCartItems()
    {
        $cart = $this->getCart();
        if (!$cart) {
            return [];
        }

        $items = $this->itemModel->where('cart_id', $cart['id'])->findAll();

        if (empty($items)) {
            return [];
        }
        // Products
        $productIds = array_column($items, 'product_id');
        if (empty($productIds)) {
            return [];
        }

        $products = $this->productManageModel->whereIn('id', $productIds)->findAll();
        $products = array_column($products, null, 'id');

        // Categories
        $categoryIds = array_unique(array_column($products, 'category_id'));

        if (!empty($categoryIds)) {
            $categories = $this->categoryModel
                ->whereIn('id', $categoryIds)
                ->findAll();
---
SELECT *
FROM `cart_items`
WHERE `cart_id` = '99'
SELECT *
FROM `categories`
WHERE `id` IN ('12')

    public function deleteCart($data)
    {
        $cart = $this->getCart();
        if (!$cart) {
            return ['status' => false, 'message' => 'Cart not found'];
        }

        $this->cartModel->where('id', $cart['id'])->delete();
---
DELETE FROM `carts`
WHERE `id` = '99'

    public function couponCodeApply($couponCode,$type = false)
    {
        $cart = $this->getCart();
        if (!$cart) {
            return ['status' => false, 'message' => 'Cart not found'];
        }
        if($type == false){
            $coupon = $this->couponcodeModel->where(['coupencode'=> $couponCode, 'is_active' => 1])->first();
---
SELECT *
FROM `coupons`
WHERE `coupencode` = 'APHWEEKEND01'
AND `is_active` = 1
 LIMIT 1

        }

        //orderpurchsed history check the coupon is used by same user then return false
        $orderHistory = $this->cartModel->where(['couponcode_id' => $coupon['id'], 'user_id' => $cart['user_id'],'status !='=>'active'])->first();
---
SELECT *
FROM `carts`
WHERE `couponcode_id` = '7'
AND `user_id` = '2'
 LIMIT 1

            return ['status' => false, 'message' => 'Coupon code is expired'];
        }
        // if coupon is used by same user then return false
        $couponUsed = $this->customerOrderModel->where(['coupen_code_id' => $coupon['id'], 'user_id' => $cart['user_id'],'status !='=>'active'])->first();
---
SELECT *
FROM `customer_orders`
WHERE `coupen_code_id` = '7'
AND `user_id` = '2'
 LIMIT 1

        }
        $total = $total - $discount;
        //insert coupon_discount and coupon id in cart
        $this->cartModel->update($cart['id'], [
            'couponcode_id' => $coupon['id'],
            'coupon_discount' => $discount
        ]);
---
UPDATE `carts` SET `couponcode_id` = '7', `coupon_discount` = '400.00'
WHERE `carts`.`id` IN ('99')