app/Services/CartService.php

SELECT *
FROM `carts`
WHERE `user_id` = '2'
 LIMIT 1
---
    private function getCart()
    {
        $session = session();

        $user = $session->get('user');
        $userId = 0;

        if ($user && isset($user['isLoggedIn']) && $user['isLoggedIn'] === true) {
            $userId = $user['userId']; // use 'id' not userId
        }

        $sessionId = $session->get('cart_session') ?? session_id();
        $session->set('cart_session', $sessionId);

        if ($userId) {
            $this->mergeCartAfterLogin();
            $cart = $this->cartModel->where('user_id', $userId)->first();

SELECT *
FROM `cart_items`
WHERE `cart_id` = '59'
SELECT *
FROM `categories`
WHERE `id` IN ('12')
---
    public function getCartItems()
    {
        $cart = $this->getCart();
        if (!$cart) {
            return [];
        }

        $items = $this->itemModel->where('cart_id', $cart['id'])->findAll();

        if (empty($items)) {
            return [];
        }
        // Products
        $productIds = array_column($items, 'product_id');
        if (empty($productIds)) {
            return [];
        }

        $products = $this->productManageModel->whereIn('id', $productIds)->findAll();
        $products = array_column($products, null, 'id');

        // Categories
        $categoryIds = array_unique(array_column($products, 'category_id'));

        if (!empty($categoryIds)) {
            $categories = $this->categoryModel
                ->whereIn('id', $categoryIds)
                ->findAll();