app/Controllers/admin/AuthController.php

    function login() {

        if( !isLoggedIn()) {
            return view('template/auth/login');
        }

        $page = "Dashboard";
        $serviceCount = $this->serviceModel->where(['status' => 1])->countAllResults() ?? 0 ;
        $memberCount = $this->userModel->where(['role !=' => 1,'status' => 'approved'])->countAllResults() ?? 0 ;
        $productCount = $this->productModel->where(['status' => 1])->countAllResults() ?? 0 ;
        $salesItemCount = $this->productManagementModel->where(['product_status' => 1])->countAllResults() ?? 0 ;
        $orderCount = $this->customerOrderModel->countAllResults() ?? 0 ;
---
SELECT COUNT(*) AS `numrows`
FROM `services`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` != 1
AND `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `product_management`
WHERE `product_status` = 1
SELECT COUNT(*) AS `numrows`
FROM `customer_orders`

    function attemptLogin() {

        if(!$this->request->isAJAX()) {
            return $this->response->setJSON(['success'=> false,'message' => lang('Cutom.invalidRequest')]);
        }

        $validation = [
            'email'     => 'required|valid_email',
            'password'  => 'required|min_length[6]',
        ];

        if(!$this->validate($validation )) {
            return $this->response->setJSON(['success' => false,'errors' => $this->validator->getErrors()]);
        }

        $userName = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userData = $this->userModel->where('email',$userName)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'nisamvp10@gmail.com'
 LIMIT 1