app/Controllers/admin/CoupenCodeController.php

INSERT INTO `coupons` (`coupenType`, `coupencode`, `discount`, `discount_type`, `minimumShopping`, `maximum_discount_amount`, `validity_from`, `validity_to`, `description`) VALUES ('1', 'VISHU10', '400', '1', '100', '500', '2026-04-10', '2026-04-10', '')
---
            }

        }else{
            if($this->couponcodeModel->insert($data)) {