app/Controllers/admin/SalesController.php

    public function index() {
        $page = (!hasPermission('','sales') ? lang('Custom.permissionDenied') :'Sales');
        $route = (!hasPermission('','sales') ?'pages-error-404' :'admin/sales/index');
        $products = $this->productModel->where(['status'=>1,'current_stock >'=>0])->findAll();
---
SELECT *
FROM `products`
WHERE `status` = 1
AND `current_stock` > 0

    private function mailnotification($order_id,$mailType) {
        if(getappdata('order_status_mail_notification') == 'off') {
            return false;
        }
        $emailService = \Config\Services::email();
        $order = $this->customerOrderModel->find($order_id);
        $order_items = $this->customerOrderItemsModel->where('customer_orders_items.customer_order_id', $order_id)->
        join('product_management', 'product_management.id = customer_orders_items.product_id')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `customer_orders`
WHERE `customer_orders`.`id` = '200'
SELECT *
FROM `customer_orders_items`
JOIN `product_management` ON `product_management`.`id` = `customer_orders_items`.`product_id`
WHERE `customer_orders_items`.`customer_order_id` = '200'