app/Controllers/frond/MyAccountController.php

    public function index()
    {
        $page = 'my-account';
        $thisUser = session('user');
        $userData = $this->usersregistrationsModel->select('id,name,phone,email')->where('id', $thisUser['userId'])->get()->getRow();
        $recentOrders = $this->customerOrdersModel->select('customer_orders.*,COUNT(coi.id) as total_items')
        ->where('user_id', $thisUser['userId'])->orderBy('id', 'DESC')
        ->join('customer_orders_items as coi','coi.customer_order_id = customer_orders.id','left')
        ->groupBy('customer_orders.id')
        ->findAll(8);
        $orders = $this->customerOrdersModel->select('customer_orders.*,COUNT(coi.id) as total_items')
        ->where('user_id', $thisUser['userId'])->orderBy('id', 'DESC')
        ->join('customer_orders_items as coi','coi.customer_order_id = customer_orders.id','left')
        ->groupBy('customer_orders.id')
        ->findAll();
        $defaultSHippingAddress = $this->shippingAddressModel->where('user_id', $thisUser['userId'])->where('is_default', 1)->get()->getRow();
---
SELECT `id`, `name`, `phone`, `email`
FROM `usersregistrations`
WHERE `id` = '2'
SELECT `customer_orders`.*, COUNT(coi.id) as total_items
FROM `customer_orders`
LEFT JOIN `customer_orders_items` as `coi` ON `coi`.`customer_order_id` = `customer_orders`.`id`
WHERE `user_id` = '2'
GROUP BY `customer_orders`.`id`
ORDER BY `id` DESC
 LIMIT 8
SELECT `customer_orders`.*, COUNT(coi.id) as total_items
FROM `customer_orders`
LEFT JOIN `customer_orders_items` as `coi` ON `coi`.`customer_order_id` = `customer_orders`.`id`
WHERE `user_id` = '2'
GROUP BY `customer_orders`.`id`
ORDER BY `id` DESC
SELECT *
FROM `shipping_addresses`
WHERE `user_id` = '2'
AND `is_default` = 1

    public function getShippingAddress() {
        $thisUser = session('user');
        $userId = $thisUser['userId'];
        $shippingAddress = $this->shippingAddressModel->where('user_id', $userId)->get()->getRow();
---
SELECT *
FROM `shipping_addresses`
WHERE `user_id` = '2'