app/Controllers/frond/PaymentSuccessController.php

    function index($orderID) {
        $page = "success";
        $orders  = $this->customerOrders->where('order_number',$orderID)->get()->getRow();
---
SELECT *
FROM `customer_orders`
WHERE `order_number` = 'ORD-20260410-000208'