app/Controllers/CheckoutController.php

SELECT *
FROM `shipping_addresses`
WHERE `user_id` = '2'
AND `is_default` = 1
SELECT *
FROM `shipping_addresses`
WHERE `session_id` = 'vs4aukvq1fn0o69rbv435g2vdgciefkk'
AND `is_default` = 1
---
            //$db->transStart();
            //4 create order
            if ($isLoggedIn) {
                $address = $this->shippingAddressModel->where('user_id', $userSession['userId'])->where('is_default', 1)->get()->getRow();
                $userData = $this->userModel->where('id', $userSession['userId'])->get()->getRow();
            } else {
                $address = $this->shippingAddressModel->where('session_id', $sessionId)->where('is_default', 1)->get()->getRow();

INSERT INTO `customer_orders` (`user_id`, `tax`, `coupen_code_id`, `discount`, `address_id`, `shipping_address`, `sub_total`, `total_amount`, `payment_method`, `payment_status`, `status`, `created_at`) VALUES ('2', 0, '7', '400.00', '12', '{\"name\":\"Prince Vt\",\"email\":null,\"phone\":\"7894561230\",\"address\":\"Valantharayil House Kanjiramukku po Near mujahid masjid\",\"city\":\"Edappal\",\"state\":\"Kerala\",\"post\":\"679584\",\"country\":\"India\"}', 401, 1, 'gateway', 'pending', 'pending', '2026-04-04 10:54:13')
UPDATE `customer_orders` SET `order_number` = 'ORD-20260404-000200'
WHERE `customer_orders`.`id` IN (200)
---
                // $order = $this->paymentGateway->createOrder($totalAmount,$orderData['order_number']);
                // $orderNumber = $this->generateOrderNumber();

                $order_id = $this->customerOrderModel->insert($orderData,true);
                $orderNumber = $this->generateOrderNumber($order_id);
                $this->customerOrderModel->update($order_id, ['order_number' => $orderNumber]);

UPDATE `customer_orders` SET `gateway_order_id` = 'order_SZIbcWDsaBG3MV'
WHERE `customer_orders`.`id` IN (200)
---
                if(isset($order['id'])){

                    //$orderData['gateway_order_id'] = $order['id'];
                    $this->customerOrderModel->update($order_id, ['gateway_order_id' => $order['id']]);//

SELECT *
FROM `customer_orders`
WHERE `gateway_order_id` = 'order_SZIbcWDsaBG3MV'
 LIMIT 1
---
    public function verifyPayment()
    {

        // $order_id = 'order_SYCisFoZwVIOXq';
        //   $order = $this->customerOrderModel->where('gateway_order_id',$order_id)->first();
        //   $shippingAddress = json_decode($order['shipping_address'], true);
        //     echo "<pre>";
        //     print_r($shippingAddress);
        //     echo "</pre>";
        //     echo   $pincode = trim($shippingAddress['post']);

        //   exit();

        $keyId = env('payment.keyId');
        $keySecret = env('payment.keySecret');

        $cart = $this->cart->getMyCart();

        $payment_id = $this->request->getPost('razorpay_payment_id');
        $order_id = $this->request->getPost('razorpay_order_id');
        $signature = $this->request->getPost('razorpay_signature');

        /* GET ORDER */
        $order = $this->customerOrderModel->where('gateway_order_id',$order_id)->first();

SELECT *
FROM `products`
WHERE `id` = '5'
 LIMIT 1
---

        foreach($orderItems as $item){

            $productManage = $this->productManageModel->where('id',$item['product_id'])->first();

UPDATE `products` SET `current_stock` = 4898
WHERE `products`.`id` IN ('5')
---

            $balanceQty = $currentStock['current_stock'] - $item['qty'];

            $this->productModel->update($productManage['product_id'], ['current_stock'=>$balanceQty]);

SELECT *
FROM `products`
WHERE `id` = '5'
 LIMIT 1
---
        $packageList = [];
        if($orderItems){
            foreach($orderItems as $item){
                $productManage = $this->productManageModel->where('id',$item['product_id'])->first();

UPDATE `customer_orders` SET `payment_status` = 'paid', `status` = 'confirmed', `shipping_order_id` = '2712619'
WHERE `gateway_order_id` = 'order_SZIbcWDsaBG3MV'
---
        ];
        $res = $this->shipbuddyService->request('orderApi/createOrder', 'POST', $payload);
        $shipping_order_id = $res['response']['data'][0]['orderId'];
        $this->customerOrderModel->where('gateway_order_id',$order_id)->set(['payment_status'=>'paid','status'=>'confirmed','shipping_order_id'=>$shipping_order_id])->update();

SELECT *
FROM `customer_orders`
WHERE `customer_orders`.`id` = '200'
SELECT *
FROM `customer_orders_items`
JOIN `product_management` ON `product_management`.`id` = `customer_orders_items`.`product_id`
WHERE `customer_orders_items`.`customer_order_id` = '200'
---
    private function sendOrderMail($order_id){
        $emailService = \Config\Services::email();
        $order = $this->customerOrderModel->find($order_id);
        $order_items = $this->customerOrderItemsModel->where('customer_orders_items.customer_order_id', $order_id)->
        join('product_management', 'product_management.id = customer_orders_items.product_id')
        ->get()
        ->getResultArray();

UPDATE `customer_orders` SET `payment_status` = 3, `status` = 3
WHERE `gateway_order_id` = 'order_SbfbMZ71HJvS5O'
---
    public function cancelOrder() {
        $orderId = $this->request->getPost('order_id');
        if($orderId) {
            $this->customerOrderModel->where('gateway_order_id',$orderId)->set(['payment_status'=>3,'status'=>3])->update();