app/Controllers/ShippingAddressController.php

UPDATE `shipping_addresses` SET `user_id` = '2', `session_id` = 'i0ndd338p0rcj62osptugsj3vugsi0hf', `full_name` = 'Prince Vt', `phone` = '7894561230', `email` = NULL, `address_line1` = 'Valantharayil House Kanjiramukku po Near mujahid masjid 123', `city` = 'Edappal', `state` = 'Kerala', `postal_code` = '679584', `country` = 'India', `created_at` = '2026-03-24 12:21:24', `updated_at` = '2026-03-24 12:21:24'
WHERE `shipping_addresses`.`id` IN ('12')
---
            'updated_at' => date('Y-m-d H:i:s'),
        ];
        if($shipping_address_id){
            $model->update($shipping_address_id, $data);

SELECT *
FROM `shipping_addresses`
WHERE `user_id` = '2'
---
    public function getShippingAddress(){
        if(!$this->request->isAJAX()){
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Invalid request',
            ]);
        }
        $results = [];
        $isLogin = $this->checkoutController->userLogin();
        if(!$isLogin){
            $results = view('frontend/user/shipping-address-list',compact('isLogin'));
        }else{
            $model = new ShippingAddressModel();
            $userId = session('user');
            $data = $model->where('user_id', $userId['userId'])->findAll();