app/Controllers/ShippingAddressController.php

    public function getShippingAddress()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setJSON(['status' => false]);
        }

        helper('cookie');
        $sessionId = get_cookie('cart_session');
        $model = new ShippingAddressModel();

        $phone = $this->request->getPost('phone');
        $email = $this->request->getPost('email');
        $user = session('user');
        //
        $data = [];
        if ($user) {
            $data = $model->where('user_id', $user['userId'])->findAll();
        } else {

            if(!empty($phone) || !empty($email)){
                $data = $this->userModel->where('phone', $phone)->orWhere('email', $email)->first();
                $where = ['user_id' => $data['id']];
            }else{
                $where = ['session_id' => $sessionId];
            }
            $data = $model->where($where)->findAll();
---
SELECT *
FROM `shipping_addresses`
WHERE `session_id` = '69a2s01v5t73tirf8b866h98fmfv8opj'