app/Models/ProductManageModel.php

SELECT `pm`.`id`, `pm`.`product_id`, `pm`.`product_title`, `pm`.`category_id`, `pm`.`price`, `pm`.`compare_price`, `pm`.`product_image`, `pm`.`product_status`, `pm`.`seo_title`, `pm`.`seo_description`, `pm`.`short_description`, `pm`.`description`, `pm`.`price_offer_type`, `pm`.`premium_product`, `pm`.`featured_product`, `pm`.`created_at`, `pm`.`updated_at`, `pvi`.`image` as `variantimages`, `pvi`.`id` as `variantimageid`, `c`.`category` as `category`, `p`.`product_name`, `p`.`sku`, `p`.`current_stock`, `p`.`status` as `stock_status`
FROM `product_management` as `pm`
LEFT JOIN `product_variant_images` as `pvi` ON `pvi`.`product_id` = `pm`.`id`
LEFT JOIN `categories` as `c` ON `c`.`id` = `pm`.`category_id`
LEFT JOIN `products` as `p` ON `p`.`id` = `pm`.`product_id`
---
    function getAllProducts() {
        $builder = $this->db->table('product_management as pm')
            ->select('pm.id,pm.product_id,pm.product_title,pm.category_id,pm.price,pm.compare_price,pm.product_image,pm.product_status,pm.seo_title,pm.seo_description,pm.short_description,pm.description,pm.price_offer_type,pm.premium_product,pm.featured_product,pm.created_at,pm.updated_at,
           pvi.image as variantimages,pvi.id as variantimageid,
           c.category as category,
           p.product_name,p.sku,p.current_stock,p.status as stock_status')
          ->join('product_variant_images as pvi','pvi.product_id = pm.id','left')
          ->join('categories as c','c.id = pm.category_id','left')
          ->join('products as p','p.id = pm.product_id','left');
        return $builder->get()->getResult();