app/Models/SettingsModel.php

SELECT *
FROM `app_settings`
WHERE `name` = 'site_mode'
 LIMIT 1
---
     public function getSetting($key)
    {
        return $this->where('name', $key)->first()['value'] ?? null;